uhnp/src/DataProcessors/ИздательСобытий/ИздательСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИздательСобытий</name>
  <comment>Выполнение задач № 000040885</comment>
  <attributes>
    <name>ТипТочкиОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/DataProcessors/ИздательСобытий/ManagerModule.bsl
// Создает издателя с определенным типом точки обмена "fanout/direct/topic"
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//  ТипОбмена     - тип точки обмена
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция СоздатьПоТипуОбмена(Знач ИмяТочкиДоступа, Знач ТипОбмена, Знач КлючСоединения = "") Экспорт

	Издатель = Обработки.ИздательСобытий.Создать();
	Издатель.ИмяТочкиОбмена = ИмяТочкиДоступа;
	Издатель.ТипТочкиОбмена = ТипОбмена;
	Издатель.КлючСоединения = КлючСоединения;
	
	Возврат Издатель;

КонецФункции // СоздатьПоТипуОбмена()
